EricH3344/kestrel/STM32/Kestrel_Gimbal_Test/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */
void link_tx_notify_tick_from_isr(void);   /* freertos.c */
/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define AUX1_SW_Pin GPIO_PIN_2
#define AUX1_SW_GPIO_Port GPIOC
#define LED_STATUS_Pin GPIO_PIN_0
#define LED_STATUS_GPIO_Port GPIOB
#define AUX2_SW_Pin GPIO_PIN_1
#define AUX2_SW_GPIO_Port GPIOB
#define SW_FLIGHT_MODE1_Pin GPIO_PIN_2
#define SW_FLIGHT_MODE1_GPIO_Port GPIOB
#define SW_FLIGHT_MODE2_Pin GPIO_PIN_10
#define SW_FLIGHT_MODE2_GPIO_Port GPIOB
#define AUX3_SW1_Pin GPIO_PIN_11
#define AUX3_SW1_GPIO_Port GPIOB
#define AUX3_SW2_Pin GPIO_PIN_12
#define AUX3_SW2_GPIO_Port GPIOB
#define LED_WARN_Pin GPIO_PIN_14
#define LED_WARN_GPIO_Port GPIOB
#define SW_ARM_Pin GPIO_PIN_14
#define SW_ARM_GPIO_Port GPIOD
#define SW_EMERGENCY_KILL_Pin GPIO_PIN_8
#define SW_EMERGENCY_KILL_GPIO_Port GPIOC
#define BTN_LEFT_Pin GPIO_PIN_9
#define BTN_LEFT_GPIO_Port GPIOC
#define USB_DM_Pin GPIO_PIN_11
#define USB_DM_GPIO_Port GPIOA
#define USB_DP_Pin GPIO_PIN_12
#define USB_DP_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define BTN_RIGHT_Pin GPIO_PIN_10
#define BTN_RIGHT_GPIO_Port GPIOC
#define WS2812_DIN_Pin GPIO_PIN_0
#define WS2812_DIN_GPIO_Port GPIOD
#define BUZZER_Pin GPIO_PIN_1
#define BUZZER_GPIO_Port GPIOD
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB
#define BTN1_Pin GPIO_PIN_4
#define BTN1_GPIO_Port GPIOB
#define BTN2_Pin GPIO_PIN_5
#define BTN2_GPIO_Port GPIOB
#define LED_LINK_Pin GPIO_PIN_7
#define LED_LINK_GPIO_Port GPIOB
#define BTN3_Pin GPIO_PIN_8
#define BTN3_GPIO_Port GPIOB
#define BTN4_Pin GPIO_PIN_9
#define BTN4_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
